# InvalidCompoundStructure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..InvalidCompoundStructure Property
BuiltInFailures..::..WallFailures Class See Also
---
Invalid compound structure.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidCompoundStructure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidCompoundStructure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidCompoundStructure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace